# ============================================================================
# Homebrew Bundle - Complete Package List
# ============================================================================
# Install all packages: brew bundle install
# Check what's missing: brew bundle check
# Clean up unlisted packages: brew bundle cleanup

# ============================================================================
# Taps - Third-party Homebrew repositories
# ============================================================================

tap "leoafarias/fvm"         # Flutter Version Manager tap

# ============================================================================
# Formulae - Command-line tools and libraries
# ============================================================================

# Core Libraries & Dependencies
brew "xz"                    # General-purpose data compression library
brew "openssl@3"             # Cryptography and SSL/TLS toolkit
brew "glib"                  # Core library for GNOME applications
brew "cryptography"          # Cryptographic recipes and primitives for Python
brew "zlib"                  # General-purpose compression library
brew "harfbuzz"              # Text shaping library (for complex text rendering)

# Cloud & DevOps
brew "awscli"                # AWS command-line interface
brew "certbot"               # Tool to obtain SSL/TLS certificates from Let's Encrypt
brew "docker-compose"        # Define and run multi-container Docker applications

# Development Tools
brew "direnv"                # Load/unload environment variables based on directory
brew "gh"                    # GitHub CLI for managing repos, PRs, and issues
brew "git"                   # Distributed version control system
brew "gnupg"                 # GNU Pretty Good Privacy (PGP) for encryption
brew "just"                  # Command runner (modern alternative to make)
brew "neovim"                # Modern Vim-based text editor
brew "nvm"                   # Node Version Manager for managing Node.js versions
brew "pandoc"                # Universal document converter (markdown, PDF, etc.)
brew "pipx"                  # Install and run Python applications in isolated environments
brew "pnpm"                  # Fast, disk space efficient package manager for Node.js
brew "pyenv"                 # Python version manager
brew "stow"                  # Symlink farm manager for managing dotfiles
brew "tree-sitter"           # Parser generator and incremental parsing library

# Mobile Development
brew "fastlane"              # Automation tool for iOS and Android deployment

# Database & SQL
brew "freetds"               # Libraries to talk to Microsoft SQL Server and Sybase databases
brew "libpq"                 # PostgreSQL C API library (includes psql client)
brew "mysql"                 # Relational database management system

# Programming Languages & Runtimes
brew "openjdk"               # Java Development Kit (latest version)
brew "openjdk@21"            # Java Development Kit version 21 (LTS)
brew "php"                   # Server-side scripting language
brew "python@3.11"           # Python programming language version 3.11
brew "python@3.12"           # Python programming language version 3.12

# PHP Tools
brew "php-cs-fixer"          # PHP Coding Standards Fixer for code formatting

# CLI Utilities - File Management
brew "bat"                   # Cat clone with syntax highlighting and Git integration
brew "eza"                   # Modern replacement for ls with icons and Git status
brew "fd"                    # Fast and user-friendly alternative to find
brew "fzf"                   # Command-line fuzzy finder
brew "ripgrep"               # Fast text search tool (better grep)
brew "yazi"                  # Blazing fast terminal file manager
brew "poppler"               # PDF rendering library
brew "p7zip"                 # 7-Zip archive file utility
brew "imagemagick"           # Image manipulation and conversion tool
brew "ghostscript"           # PostScript and PDF interpreter (for PDF rendering in neovim)
brew "mermaid-cli"           # CLI for Mermaid diagram generation
brew "wget"                  # Internet file retriever
brew "zoxide"                # Smarter cd command that learns your habits

# CLI Utilities - Text & Display
brew "figlet"                # Generate ASCII art text banners
brew "git-delta"             # Syntax-highlighting pager for git diff output
brew "glow"                  # Markdown renderer for the terminal
brew "grc"                   # Generic colorizer for terminal output
brew "gum"                   # Tool for glamorous shell scripts (styled UI components)
brew "lolcat"                # Rainbow colorizer for terminal output
brew "starship"              # Minimal, fast, and customizable prompt for any shell

# CLI Utilities - Development
brew "antidote"              # Zsh plugin manager
brew "htop"                  # Interactive process viewer
brew "jq"                    # Lightweight JSON processor
brew "lazygit"               # Terminal UI for git commands
brew "tmux"                  # Terminal multiplexer for managing multiple terminal sessions
brew "yq"                    # Process YAML, JSON, XML, CSV files from CLI
brew "zsh-autosuggestions"   # Fish-like autosuggestions for zsh

# CLI Utilities - Media
brew "cava"                  # Console-based Audio Visualizer for ALSA
brew "ffmpeg"                # Multimedia framework for audio/video processing
brew "mpd"                   # Music Player Daemon - headless music player server
brew "rmpc"                  # Rusty Music Player Client - modern TUI for MPD
brew "yt-dlp"                # Feature-rich YouTube downloader

# Email Tools
brew "neomutt"               # E-mail client with IMAP/SMTP support
brew "w3m"                   # Text-based web browser
brew "felinks"               # Enhanced text browser (elinks fork) with CSS support
brew "urlscan"               # URL extractor
brew "chafa"                 # Image viewer with Kitty graphics protocol support
brew "lbdb"                  # Little Brother's Database - contact lookup for neomutt

# Social Media
brew "toot"                  # Mastodon CLI and TUI client

# Custom Tap Packages
brew "leoafarias/fvm/fvm"              # Flutter Version Manager

# ============================================================================
# Casks - GUI Applications
# ============================================================================

# Fonts
cask "font-hack-nerd-font"  # Hack Nerd Font with programming glyphs and icons

# Applications - Developer Tools
cask "visual-studio-code"    # Microsoft's extensible code editor
cask "basictex"              # Minimal TeX distribution for LaTeX rendering

# Applications - Utilities
cask "1password-cli"         # 1Password command-line tool for password management
cask "ghostty"               # Fast, native, GPU-accelerated terminal emulator

# Applications - Media
cask "audacity"              # Free, open-source audio editor and recorder
cask "obs"                   # Open Broadcaster Software for streaming and recording

# ============================================================================
# OBS Plugins
# ============================================================================
# Plugins are managed via obs-studio/manage-plugins.sh and obs-studio/plugins.txt
# Check status: cd obs-studio && ./manage-plugins.sh status
# Note: OBS plugins require manual download (sudo install, not suitable for Brewfile)
# ============================================================================

# ============================================================================
# VS Code Extensions
# ============================================================================
# Extensions are managed via vscode/manage-extensions.sh and vscode/extensions.txt
# Install extensions: cd vscode && ./manage-extensions.sh install
# Sync extensions: cd vscode && ./manage-extensions.sh sync
# ============================================================================

