# ============================================================================
# Homebrew Bundle - Complete Package List
# ============================================================================
# Install all packages: brew bundle install
# Check what's missing: brew bundle check
# Clean up unlisted packages: brew bundle cleanup

# ============================================================================
# Taps - Third-party Homebrew repositories
# ============================================================================

tap "leoafarias/fvm"         # Flutter Version Manager tap

# ============================================================================
# Formulae - Command-line tools and libraries
# ============================================================================

# Core Libraries & Dependencies
brew "xz"                    # General-purpose data compression library
brew "openssl@3"             # Cryptography and SSL/TLS toolkit
brew "glib"                  # Core library for GNOME applications
brew "cryptography"          # Cryptographic recipes and primitives for Python
brew "zlib"                  # General-purpose compression library
brew "harfbuzz"              # Text shaping library (for complex text rendering)

# Cloud & DevOps
brew "awscli"                # AWS command-line interface
brew "certbot"               # Tool to obtain SSL/TLS certificates from Let's Encrypt
brew "docker-compose"        # Define and run multi-container Docker applications

# Development Tools
brew "direnv"                # Load/unload environment variables based on directory
brew "gh"                    # GitHub CLI for managing repos, PRs, and issues
brew "git"                   # Distributed version control system
brew "gnupg"                 # GNU Pretty Good Privacy (PGP) for encryption
brew "just"                  # Command runner (modern alternative to make)
brew "neovim"                # Modern Vim-based text editor
brew "nvm"                   # Node Version Manager for managing Node.js versions
brew "pandoc"                # Universal document converter (markdown, PDF, etc.)
brew "pipx"                  # Install and run Python applications in isolated environments
brew "pnpm"                  # Fast, disk space efficient package manager for Node.js
brew "pyenv"                 # Python version manager
brew "stow"                  # Symlink farm manager for managing dotfiles
brew "tree-sitter"           # Parser generator and incremental parsing library

# Mobile Development
brew "fastlane"              # Automation tool for iOS and Android deployment

# Database & SQL
brew "freetds"               # Libraries to talk to Microsoft SQL Server and Sybase databases
brew "libpq"                 # PostgreSQL C API library (includes psql client)
brew "mysql"                 # Relational database management system

# Programming Languages & Runtimes
brew "openjdk"               # Java Development Kit (latest version)
brew "openjdk@21"            # Java Development Kit version 21 (LTS)
brew "php"                   # Server-side scripting language
brew "python@3.11"           # Python programming language version 3.11
brew "python@3.12"           # Python programming language version 3.12

# PHP Tools
brew "php-cs-fixer"          # PHP Coding Standards Fixer for code formatting

# CLI Utilities - File Management
brew "bat"                   # Cat clone with syntax highlighting and Git integration
brew "eza"                   # Modern replacement for ls with icons and Git status
brew "fd"                    # Fast and user-friendly alternative to find
brew "fzf"                   # Command-line fuzzy finder
brew "ripgrep"               # Fast text search tool (better grep)

# CLI Utilities - Text & Display
brew "figlet"                # Generate ASCII art text banners
brew "git-delta"             # Syntax-highlighting pager for git diff output
brew "glow"                  # Markdown renderer for the terminal
brew "grc"                   # Generic colorizer for terminal output
brew "gum"                   # Tool for glamorous shell scripts (styled UI components)
brew "lolcat"                # Rainbow colorizer for terminal output
brew "starship"              # Minimal, fast, and customizable prompt for any shell

# CLI Utilities - Development
brew "lazygit"               # Terminal UI for git commands
brew "tmux"                  # Terminal multiplexer for managing multiple terminal sessions
brew "yq"                    # Process YAML, JSON, XML, CSV files from CLI
brew "zsh-autosuggestions"   # Fish-like autosuggestions for zsh

# Custom Tap Packages
brew "leoafarias/fvm/fvm"              # Flutter Version Manager

# ============================================================================
# Casks - GUI Applications
# ============================================================================

# Fonts
cask "font-hack-nerd-font"  # Hack Nerd Font with programming glyphs and icons

cask "1password-cli"         # 1Password command-line tool for password management
cask "anaconda"              # Python distribution for data science and machine learning
cask "android-file-transfer" # Browse and transfer files from Android devices
cask "ghostty"               # Fast, native, GPU-accelerated terminal emulator

# ============================================================================
# VSCode Extensions - Development Tools
# ============================================================================

# Themes & UI
vscode "akamud.vscode-theme-onedark"           # One Dark Pro theme
vscode "dooez.alt-catppuccin-vsc"              # Alternative Catppuccin theme
vscode "pkief.material-icon-theme"             # Material Design icons for files
vscode "ms-vscode.theme-markdownkit"           # Markdown theme

# Core Development Tools
vscode "anthropic.claude-code"                 # Claude Code AI assistant
vscode "github.copilot"                        # GitHub Copilot AI code completion
vscode "github.copilot-chat"                   # GitHub Copilot chat interface
vscode "editorconfig.editorconfig"             # EditorConfig support for consistent coding styles

# Git & Version Control
vscode "eamodio.gitlens"                       # Supercharged Git capabilities
vscode "github.vscode-pull-request-github"     # GitHub Pull Request and Issues integration
vscode "github.vscode-github-actions"          # GitHub Actions workflow support

# Linting & Formatting
vscode "dbaeumer.vscode-eslint"                # ESLint JavaScript linter
vscode "esbenp.prettier-vscode"                # Prettier code formatter
vscode "rvest.vs-code-prettier-eslint"         # Prettier + ESLint integration
vscode "davidanson.vscode-markdownlint"        # Markdown linting and style checking

# Language Support - Web Development
vscode "astro-build.astro-vscode"              # Astro framework support
vscode "bradlc.vscode-tailwindcss"             # Tailwind CSS IntelliSense
vscode "octref.vetur"                          # Vue 2 tooling
vscode "vue.volar"                             # Vue 3 language support
vscode "vunguyentuan.vscode-postcss"           # PostCSS syntax highlighting

# Language Support - Mobile Development
vscode "dart-code.dart-code"                   # Dart language support
vscode "dart-code.flutter"                     # Flutter framework support
vscode "gmlewis-vscode.flutter-stylizer"       # Flutter widget formatting

# Language Support - Backend & Systems
vscode "ms-dotnettools.csharp"                 # C# language support
vscode "ms-dotnettools.vscode-dotnet-runtime"  # .NET Runtime installer
vscode "redhat.vscode-yaml"                    # YAML language support
vscode "neilbrayfield.php-docblocker"          # PHP DocBlock generator

# Language Support - Data & Config
vscode "eriklynd.json-tools"                   # JSON formatting and validation
vscode "wekex.jsonlint"                        # JSON linting
vscode "mechatroner.rainbow-csv"               # CSV file colorizer
vscode "quicktype.quicktype"                   # Generate types from JSON

# Python Development
vscode "ms-python.python"                      # Python language support
vscode "ms-python.vscode-pylance"              # Fast Python language server
vscode "ms-python.debugpy"                     # Python debugger
vscode "ms-python.vscode-python-envs"          # Python environment manager

# Jupyter Notebooks
vscode "ms-toolsai.jupyter"                    # Jupyter notebook support
vscode "ms-toolsai.jupyter-keymap"             # Jupyter keyboard shortcuts
vscode "ms-toolsai.jupyter-renderers"          # Jupyter output renderers
vscode "ms-toolsai.vscode-jupyter-cell-tags"   # Jupyter cell tagging
vscode "ms-toolsai.vscode-jupyter-powertoys"   # Jupyter power user tools
vscode "ms-toolsai.vscode-jupyter-slideshow"   # Jupyter slideshow creator
vscode "ms-toolsai.datawrangler"               # Data cleaning and transformation
vscode "sam-the-programmer.jupyter-theme"      # Jupyter theme customization

# Docker & Containers
vscode "docker.docker"                         # Docker support
vscode "ms-azuretools.vscode-docker"           # Azure Docker tools
vscode "ms-azuretools.vscode-containers"       # Dev Containers support
vscode "ms-vscode-remote.remote-containers"    # Remote development in containers

# Remote Development
vscode "ms-vscode-remote.remote-ssh"           # Remote development via SSH
vscode "ms-vscode-remote.remote-ssh-edit"      # Edit SSH config files
vscode "ms-vscode.remote-explorer"             # Remote explorer view

# AWS & Cloud
vscode "amazonwebservices.aws-toolkit-vscode"  # AWS Toolkit for VS Code

# API & Documentation
vscode "redocly.openapi-vs-code"               # OpenAPI (Swagger) support
vscode "attilabuti.vscode-mjml"                # MJML email template support
vscode "dawhite.mustache"                      # Mustache template support
vscode "imgildev.vscode-mustache-snippets"     # Mustache snippets

# UI/UX Tools
vscode "figma.figma-vscode-extension"          # Figma integration

# Build Tools
vscode "vscjava.vscode-gradle"                 # Gradle build tool support

# Editor Enhancements
vscode "vscodevim.vim"                         # Vim keybindings
vscode "ms-vscode.live-server"                 # Live preview server
vscode "streetsidesoftware.code-spell-checker" # Spell checker for code
vscode "yoavbls.pretty-ts-errors"              # Better TypeScript error messages

# Fun & Productivity
vscode "tonybaloney.vscode-pets"               # Virtual pets in VS Code
vscode "nicollasr.vscode-streamdeck"           # Stream Deck integration
