akamud.vscode-theme-onedark
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
astro-build.astro-vscode
attilabuti.vscode-mjml
bradlc.vscode-tailwindcss
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dawhite.mustache
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
editorconfig.editorconfig
eriklynd.json-tools
esbenp.prettier-vscode
figma.figma-vscode-extension
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
gmlewis-vscode.flutter-stylizer
imgildev.vscode-mustache-snippets
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.theme-markdownkit
neilbrayfield.php-docblocker
nicollasr.vscode-streamdeck
octref.vetur
pkief.material-icon-theme
quicktype.quicktype
redhat.vscode-yaml
redocly.openapi-vs-code
rvest.vs-code-prettier-eslint
sam-the-programmer.jupyter-theme
streetsidesoftware.code-spell-checker
tonybaloney.vscode-pets
vscjava.vscode-gradle
vscodevim.vim
vue.volar
vunguyentuan.vscode-postcss
wekex.jsonlint
yoavbls.pretty-ts-errors
